package util

import "strings"

var GEO = map[string][2]float64{
	"晋江校区A":   {118.585637992599, 24.557758583454426},
	"晋江校区B":   {118.58492906232163, 24.557395418615222},
	"大梦书屋":    {119.19733999999994, 26.05926300000002},
	"嘉锡楼":     {119.19447500000001, 26.059567},
	"阳光科技楼":   {119.20233499999995, 26.052188999999988},
	"阳光楼":     {119.20233499999995, 26.052188999999988},
	"福州大学图书馆": {119.19767194009012, 26.05896002955218},
	"晋江楼":     {119.20112561376197, 26.061205809110632},
	"铜盘科报厅A":  {26.103566850977305, 119.26282667315306},
	"铜盘科报厅B":  {26.103443904554403, 119.26236726136176},
}

func FindGeoLocation(location string) (float64, float64) {
	for key, value := range GEO {
		if strings.Contains(location, key) {
			return value[0], value[1]
		}
	}
	return 0, 0
}
